# Завдання 3
#
# Напишіть функцію, яка визначає кількість простих чисел у списку цілих.
# Список передається як параметр. Отриманий результат повертається із функції.
numbers=[1,3,6,8,8,0,54]
for i in range(numbers):
    if i%2==0:
        simple_number=i
        print(simple_number)

# Завдання 2

# Напишіть функцію для знаходження мінімуму у списку цілих.
# Список передається як параметр. Отриманий результат повертається із функції.


numbers=[1,3,6,8,8,0,54,]
min_n=min(numbers)

print(f"minimal_number= {min_n}")


# Завдання 1
#
# Напишіть функцію, яка обчислює добуток елементів списку цілих.
# Список передається як параметр. Отриманий результат повертається із функції.

list1=[2,4,10]
dobutok=1

for i in list1:
    dobutok*=i

print(dobutok)

# Завдання 4
#
# Напишіть функцію, яка видаляє зі списку ціле задане число.
# З функції потрібно повернути кількість видаленних елементів.
list1=[2,4,10]
q=int(input("eneter a number"))

list1.remove(q)

print(list1)


# Завдання 5
#
# Напишіть функцію, яка отримує два списки як параметр
# і повертає список, що містить елементи обох списків.


lst1={1,3,65,7,9,3,2,}
lst2={2,5,8,3,0,1,6,}
lst3=lst1.union(lst2)
print(lst3)


# Завдання 6
#
# Напишіть функцію, яка обчислює ступінь кожного елемента списку цілих.
# Значення для ступеня передається як параметр, список також передається як параметр.
# Функція повертає новий список, який містить отримані результати.
lst1=[1,3,65,7,9,3,2,]
q=int(input("huh"))

for i in range(len(lst1)):
    lst1[i]**=q
print(lst1)

